---
kind: property
id: P:Autodesk.Revit.DB.DefaultDivideSettings.PathMeasurementType
source: html/6f4f7a4d-112c-10ef-d675-da94d5ea4404.htm
---
# Autodesk.Revit.DB.DefaultDivideSettings.PathMeasurementType Property

A default Divided Path measurement type for distance layouts.

## Syntax (C#)
```csharp
public DividedPathMeasurementType PathMeasurementType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration